---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralSectionCommonCentroidHoriz
source: html/7ee85da8-9ac6-842e-0753-bfd442d3e0e6.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralSectionCommonCentroidHoriz Property

"Centroid Horizontal"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralSectionCommonCentroidHoriz { get; }
```